tap 'bramstein/webfonttools'
tap 'homebrew/bundle'
tap 'homebrew/core'


#
# Comment or uncomment if you want to adapt your installation
#

# OSX Terminal stuff that will make your life easier
brew 'bash'
brew 'coreutils'
brew 'curl'
brew 'git'
brew 'git-lfs'
brew 'tmux'
brew 'fzf'
brew 'go'
brew 'n'
brew 'nvm'
brew 'trash'
brew 'wget'
brew 'tfenv'
brew 'pyenv'
brew 'pipenv'
brew 'minikube'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'kubectx'
brew 'jq'
brew 'yq'


#
# system tools
#

# cask 'osxfuse'
# let you mount windows drives and write on it

cask 'iterm2'
# iterm2 command line terminal

# cask 'appcleaner'
# remove apps with system setting files

# cask 'caffeine'
# can keep you mac awake when you give a talk for example

# cask 'disk-inventory-x'
# helps you to find large files

# cask 'hyper'
# nicer looking and hackable terminal

# cask 'monolingual'
# tool to remove unused languages for your mac

# cask 'recordit'
# record a part of the screen as gif

# cask 'bartender'
# hide some icons from the OSX toolbar

cask 'the-unarchiver'
# better Unarchiver for OSX (support more formats but works the same)

# cask 'insomnia'
# Insomnia app helps interact with HTTP-based APIs (REST API Client)

# cask 'tunnelbear'
# VPN

# extends quicklook so it supports more formats
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen' 
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webpquicklook'

#
# Text & Code
#

cask 'visual-studio-code'
# microsoft's visual studio code editor

# cask 'atom'
# free and powerful text editor

cask 'sublime-text'
# alternative text editor (a bit faster then atom, but less easy to use)

# cask 'haroopad'
# good markdown editor

#
# Cloud Native Tools
#
cask 'docker'
# Docker runtime for Mac

cask 'vagrant'
# Development environment

#
# Internet stuff
#
# cask 'google-chrome'
cask 'firefox'
# browser

# cask 'transmit'
# cask 'cyberduck'
# ftp

#
# Collaboration
#
cask 'slack'
cask 'discord'
cask 'notion'
cask 'coconutbattery'
# cask 'skype'
# cask 'whatsapp'
# cask 'telegram'
# cask 'signal'
# cask 'github-desktop'

#
# Multimedia & Tools
#

cask 'vlc'
cask 'spotify'
cask 'nvidia-geforce-now'
cask 'kindle'

#
# VPN
#
cask 'tunnelblick'
cask 'viscosity'
cask 'linkliar'
cask 'protonvpn'

#
# Password Manager
#
cask 'bitwarden'
cask '1password'
