tap 'bramstein/webfonttools'
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/fuse'
tap 'homebrew/versions'


#
# Comment or uncomment if you want to adapt your installation
#

# OSX Terminal stuff that will make your life easier
brew 'bash'
brew 'coreutils'
brew 'curl'
brew 'git'
brew 'git-lfs'
brew 'n'
brew 'trash'
brew 'wget'

#
# system tools
#

cask 'osxfuse'
# let you mount windows drives and write on it

cask 'appcleaner'
# remove apps with system setting files

cask 'caffeine'
# can keep you mac awake when you give a talk for example

cask 'disk-inventory-x'
# helps you to find large files

cask 'hyper'
# nicer looking and hackable terminal

cask 'monolingual'
# tool to remove unused languages for your mac

cask 'recordit'
# record a part of the screen as gif

cask 'bartender'
# hide some icons from the OSX toolbar

cask 'the-unarchiver'
# better Unarchiver for OSX (support more formats but works the same)

cask 'insomnia'
# Insomnia app helps interact with HTTP-based APIs (REST API Client)

cask 'tunnelbear'
# VPN

# extends quicklook so it supports more formats
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen' 
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webpquicklook'

#
# Text & Code
#

cask 'visual-studio-code'
# microsoft's visual studio code editor

cask 'atom'
# free and powerful text editor

cask 'sublime-text'
# alternative text editor (a bit faster then atom, but less easy to use)

cask 'haroopad'
# good markdown editor

#
# Cloud Native Tools
#
cask 'docker'
# Docker runtime for Mac

#
# Internet stuff
#
cask 'google-chrome'
# browser

cask 'transmit'
# ftp

#
# Collaboration
#
cask 'slack'
cask 'skype'
cask 'whatsapp'
cast 'telegram'
cask 'github-desktop'

#
# Multimedia & Tools
#

cask 'vlc'
cask 'spotify'
